#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
    УзелИнформационнойБазы = ПолучитьУзелИнформационнойБазы();
	Если ЗначениеЗаполнено(УзелИнформационнойБазы) Тогда  
		НавигационнаяСсылкаПриемника = ПолучитьНавигационнуюСсылкуСопоставленногоОбъекта(ПараметрКоманды, УзелИнформационнойБазы);
		Если ЗначениеЗаполнено(НавигационнаяСсылкаПриемника) Тогда
			ПерейтиПоНавигационнойСсылке(НавигационнаяСсылкаПриемника);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьУзелИнформационнойБазы()
	Контекст = "ППСО_ПерейтиКСопоставленномуОбъекту.ПолучитьУзелИнформационнойБазы";
	
	Выборка = ПланыОбмена.ОбменБГУ2ЕМП.Выбрать();
	Если Выборка.Следующий() Тогда  
	    ПланОбменаСсылка = Выборка.Ссылка;
		Возврат ПланОбменаСсылка;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПолучитьНавигационнуюСсылкуСопоставленногоОбъекта(ОбъектСсылка, УзелИнформационнойБазы)
	
	Контекст = "ППСО_ПерейтиКСопоставленномуОбъекту.ПолучитьНавигационнуюСсылкуСопоставленногоОбъекта";
	
	МенеджерРегистраСоответствийОбъектов = РегистрыСведений.СоответствияОбъектовИнформационныхБаз;

	УникальныйИдентификаторИсточника = ОбъектСсылка.УникальныйИдентификатор();
	ТипИсточника = Метаданные.НайтиПоТипу(ТипЗнч(ОбъектСсылка)).ПолноеИмя();
	                                                                         
	// Запрос для определения информации о сопоставлении объектов для подмены ссылки источника, на ссылку приемника.
	ЗапросСоответствияОбъектовИнформационныхБаз = Новый Запрос;
	ЗапросСоответствияОбъектовИнформационныхБаз.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника,
	|	СоответствияОбъектовИнформационныхБаз.ТипПриемника
	|ИЗ
	|	РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
	|ГДЕ
	|	  СоответствияОбъектовИнформационныхБаз.УзелИнформационнойБазы           = &УзелИнформационнойБазы
	|	И СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточника = &УникальныйИдентификаторИсточника
	|";
	//
	
	ЗапросСоответствияОбъектовИнформационныхБаз.УстановитьПараметр("УзелИнформационнойБазы", УзелИнформационнойБазы);
	ЗапросСоответствияОбъектовИнформационныхБаз.УстановитьПараметр("УникальныйИдентификаторИсточника", ОбъектСсылка);
	
	РезультатЗапроса = ЗапросСоответствияОбъектовИнформационныхБаз.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		УникальныйИдентификаторПриемника = УникальныйИдентификаторИсточника;
		//ТипПриемника = ТипИсточника;
		ТипПриемника = "ДокументСсылка.АктВыполненныхРабот";
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		УникальныйИдентификаторПриемника = Выборка.УникальныйИдентификаторПриемника;
		ТипПриемника = Выборка.ТипПриемника;
		
		ЗаписьЖурналаРегистрации("Переход к сопоставленному объекту. Сведения о сопоставлении найдены",
			УровеньЖурналаРегистрации.Информация,
			Метаданные.НайтиПоТипу(ТипЗнч(ОбъектСсылка)), ОбъектСсылка,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В регистре СоответствияОбъектовИнформационныхБаз
					|не найдены сведения для объекта ""%2"" (тип %3, уникальный идентификатор %4).
					|Сопоставленный объект не найден.
					|
					|Контекст ""%1""'",
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				Контекст,
				Строка(ОбъектСсылка), ТипИсточника, УникальныйИдентификаторИсточника));
				
	КонецЕсли;
		
	//+Выборка.COMИмяСервера1СПредприятия+"/"+Выборка.COMИмяИнформационнойБазыНаСервере1СПредприятия+"#e1cib/data/"+
	ПрефиксНавигационнойСсылки = "e1c://server/account/EMP";
	
	НаименованиеТипаОбъектаПриемника = СтрЗаменить(ТипПриемника, "Ссылка.", ".");
	
	ПараметрНавигационнойСсылкиНаОбъектПриемника =
		Сред(УникальныйИдентификаторПриемника, 20, 4) +
		Сред(УникальныйИдентификаторПриемника, 25, 12) +
		Сред(УникальныйИдентификаторПриемника, 15, 4) +
		Сред(УникальныйИдентификаторПриемника, 10, 4) +
		Лев(УникальныйИдентификаторПриемника, 8);
	
	НавигационнаяСсылкаПриемника = ПрефиксНавигационнойСсылки + 
		"#e1cib/data/" + НаименованиеТипаОбъектаПриемника +
		"?ref=" + ПараметрНавигационнойСсылкиНаОбъектПриемника;
	
	ЗаписьЖурналаРегистрации("Переход к сопоставленному объекту",
		УровеньЖурналаРегистрации.Примечание,
		Метаданные.НайтиПоТипу(ТипЗнч(ОбъектСсылка)), ОбъектСсылка,
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для объекта ""%2"" (тип %3, уникальный идентификатор %4)
				|сопоставлен объект с уникальным идентификатором %6 (тип %5).
				|
				|Навигационная ссылка сопоставленного объекта:
				|%7
				|
				|Контекст ""%1""'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			Контекст,
			Строка(ОбъектСсылка), ТипИсточника, УникальныйИдентификаторИсточника,
			ТипПриемника, УникальныйИдентификаторПриемника,
			НавигационнаяСсылкаПриемника));
		
	Возврат НавигационнаяСсылкаПриемника; 
	
КонецФункции

#КонецОбласти
