#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриИзмененииВыбранногоСопоставленногоОбъекта();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийСписка

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	ПриИзмененииВыбранногоСопоставленногоОбъекта();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерейтиКСопоставленномуОбъекту(Команда)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;

	НавигационнаяСсылкаИнформационнойБазыПриемника =
		ППСО_ОбменДаннымиВызовСервера.ПолучитьНавигационнуюСсылкуУзлаИнформационнойБазы(ТекущиеДанные.УзелИнформационнойБазы);

	НавигационнаяСсылкаПриемника = РаботаСНавигационнымиСсылкамиКлиентСервер.ПолучитьНавигационнуюСсылкуПоРеквизитам(
		ТекущиеДанные.УникальныйИдентификаторПриемника, ТекущиеДанные.ТипПриемника,
		НавигационнаяСсылкаИнформационнойБазыПриемника);

	ПерейтиПоНавигационнойСсылке(НавигационнаяСсылкаПриемника);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииВыбранногоСопоставленногоОбъекта()
	
	ДоступностьПерехода = СтандартныеПодсистемыКлиент.ЭтоЭлементДинамическогоСписка(Элементы.Список);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокПерейтиКСопоставленномуОбъекту", "Доступность", ДоступностьПерехода);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПерейтиКСопоставленномуОбъекту", "Доступность", ДоступностьПерехода);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокКонтекстноеМенюПерейтиКСопоставленномуОбъекту", "Доступность", ДоступностьПерехода);

КонецПроцедуры

#КонецОбласти
