#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерейтиКСопоставленномуОбъекту(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	НавигационнаяСсылкаПриемника = ППСО_ОбменДаннымиКлиентСервер.ПолучитьНавигационнуюСсылкуСопоставленногоОбъектаПоРеквизитам(
		ТекущиеДанные.УникальныйИдентификаторПриемника, ТекущиеДанные.ТипПриемника,
		ТекущиеДанные.ИмяСервера, ТекущиеДанные.ИмяИнформационнойБазы);
	ПерейтиПоНавигационнойСсылке(НавигационнаяСсылкаПриемника);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
