#Область ПрограммныйИнтерфейс

// Функция - Получить ссылку на объект в текущей информационной базе по навигационной ссылке
//
// Параметры:
//  НавигационнаяСсылка 			- Строка	 - навигационная ссылка
// 
// Возвращаемое значение:
//  Ссылка - ссылка для объекта, для которого была передана навигационная ссылка
//
Функция ПолучитьСсылкуПоНавигационнойСсылке(Знач НавигационнаяСсылка) Экспорт                         
	РеквизитыНавигационнойСсылки = РаботаСНавигационнымиСсылкамиКлиентСервер.ПолучитьРеквизитыНавигационнойСсылки(НавигационнаяСсылка);
	ТипСсылки = СтрЗаменить(РеквизитыНавигационнойСсылки.ИмяТипа, ".", "Ссылка.");
	Ссылка = XMLЗначение(Тип(ТипСсылки), Строка(РеквизитыНавигационнойСсылки.УникальныйИдентификатор));
	Возврат Ссылка;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
