#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриИзмененииСопоставленногоОбъекта();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПерейтиКСопоставленномуОбъекту(Команда)
	ПерейтиПоНавигационнойСсылке(НавигационнаяСсылкаПриемника);
КонецПроцедуры

&НаКлиенте
Процедура УникальныйИдентификаторИсточникаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Запись.УникальныйИдентификаторИсточника) Тогда 
		Запись.УникальныйИдентификаторИсточникаСтрокой = Запись.УникальныйИдентификаторИсточника.УникальныйИдентификатор();
		Запись.ТипИсточника = ПолучитьСтроковоеПредставлениеТипа(ТипЗнч(Запись.УникальныйИдентификаторИсточника));
		//Метаданные.НайтиПоТипу(ТипЗнч(Запись.УникальныйИдентификаторИсточника)).ПолноеИмя();
	Иначе
		Запись.УникальныйИдентификаторИсточникаСтрокой = "";
		Запись.ТипИсточника = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УзелИнформационнойБазыПриИзменении(Элемент)
	ПриИзмененииСопоставленногоОбъекта();
КонецПроцедуры

&НаКлиенте
Процедура УникальныйИдентификаторПриемникаПриИзменении(Элемент)
	ПриИзмененииСопоставленногоОбъекта();
КонецПроцедуры

&НаКлиенте
Процедура ТипПриемникаПриИзменении(Элемент)
	ПриИзмененииСопоставленногоОбъекта();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриИзмененииСопоставленногоОбъекта()
	
	Элементы.ПерейтиКСопоставленномуОбъекту.Доступность = Ложь;
	Элементы.ФормаПерейтиКСопоставленномуОбъекту.Доступность = Ложь;
	
	Попытка
		РеквизитыПодключения = ППСО_ОбменДаннымиВызовСервера.ПолучитьРеквизитыПодключенияКУзлуИнформационнойБазы(
			Запись.УзелИнформационнойБазы);
		ЭтотОбъект.ИмяСервера = РеквизитыПодключения.ИмяСервера;
		ЭтотОбъект.ИмяИнформационнойБазы = РеквизитыПодключения.ИмяИнформационнойБазы;
		ЭтотОбъект.НавигационнаяСсылкаПриемника = ППСО_ОбменДаннымиКлиентСервер.ПолучитьНавигационнуюСсылкуСопоставленногоОбъектаПоРеквизитам(
			Запись.УникальныйИдентификаторПриемника, Запись.ТипПриемника,
			ЭтотОбъект.ИмяСервера,
			ЭтотОбъект.ИмяИнформационнойБазы);
		Элементы.ПерейтиКСопоставленномуОбъекту.Доступность = Истина;
		Элементы.ФормаПерейтиКСопоставленномуОбъекту.Доступность = Истина;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтроковоеПредставлениеТипа(Знач ТипЗначения)
	Возврат ОбщегоНазначения.СтроковоеПредставлениеТипа(ТипЗначения);
КонецФункции

#КонецОбласти
